[
  {
    "id": 1,
    "title": "Understanding Climate Change and Its Global Impact",
    "image": "https://i.ibb.co.com/qLC8qkqR/qingbao-meng-01-ig-Fr7hd4-unsplash.jpg",
    "body": "Climate change is one of the most pressing challenges facing humanity today. Rising global temperatures, melting glaciers, and extreme weather events are increasingly affecting ecosystems and human livelihoods. This article explores the science behind climate change, its causes, and the long-term consequences if mitigation efforts are not strengthened. We also discuss adaptation strategies that communities can adopt to reduce vulnerability and enhance resilience.",
    "user": {
      "id": 1,
      "name": "John Doe",
      "avatar": "https://i.pravatar.cc/40?img=1"
    }
  },
  {
    "id": 2,
    "title": "Disaster Risk Reduction: Why Preparedness Saves Lives",
    "image": "https://i.ibb.co.com/MDHdCvp6/noah-buscher-x8-ZStuk-S2-PM-unsplash.jpg",
    "body": "Disaster Risk Reduction (DRR) focuses on minimizing vulnerabilities and disaster risks to avoid or limit adverse impacts. Preparedness, early warning systems, and community engagement play a vital role in reducing loss of life and property. This blog highlights real-world examples where preparedness initiatives significantly reduced disaster impacts.",
    "user": {
      "id": 2,
      "name": "Jane Smith",
      "avatar": "https://i.pravatar.cc/40?img=2"
    }
  },
  {
    "id": 3,
    "title": "Flood Forecasting and Early Warning Systems Explained",
    "image": "https://i.ibb.co.com/MkPT5JFk/john-o-nolan-u-MWPrc-Rsrto-unsplash.jpg",
    "body": "Flood forecasting combines hydrological models, meteorological data, and satellite observations to predict flood events. Early warning systems enable governments and communities to take timely actions such as evacuation and resource mobilization. This article explains how modern forecasting tools work and why impact-based forecasting is a game changer.",
    "user": {
      "id": 3,
      "name": "Alice Johnson",
      "avatar": "https://i.pravatar.cc/40?img=3"
    }
  },
  {
    "id": 4,
    "title": "How GIS and Remote Sensing Support Sustainable Development",
    "image": "https://i.ibb.co.com/dsvB0fP6/grant-ritchie-x1w-Q78x-NEY-unsplash.jpg",
    "body": "Geographic Information Systems (GIS) and Remote Sensing provide powerful tools for monitoring environmental change, urban growth, and natural hazards. From land-use mapping to water resource assessment, these technologies help decision-makers plan sustainably and respond effectively to emerging challenges.",
    "user": {
      "id": 1,
      "name": "John Doe",
      "avatar": "https://i.pravatar.cc/40?img=1"
    }
  },
  {
    "id": 5,
    "title": "Water Scarcity: Challenges and Innovative Solutions",
    "image": "https://i.ibb.co.com/wNvTmwJN/gustavo-quepons-p-F-2lrj-Wi-JE-unsplash.jpg",
    "body": "Water scarcity affects millions of people worldwide due to population growth, climate change, and poor management. This blog discusses the key drivers of water scarcity and explores innovative solutions such as rainwater harvesting, water reuse, and efficient irrigation technologies.",
    "user": {
      "id": 2,
      "name": "Jane Smith",
      "avatar": "https://i.pravatar.cc/40?img=2"
    }
  },
  {
    "id": 6,
    "title": "Community-Based Approaches to Disaster Management",
    "image": "https://i.ibb.co.com/qLC8qkqR/qingbao-meng-01-ig-Fr7hd4-unsplash.jpg",
    "body": "Community-based disaster management empowers local people to identify risks, plan responses, and recover from disasters. By integrating indigenous knowledge with scientific approaches, communities become more resilient. This article highlights best practices and lessons learned from field experiences.",
    "user": {
      "id": 3,
      "name": "Alice Johnson",
      "avatar": "https://i.pravatar.cc/40?img=3"
    }
  },
  {
    "id": 7,
    "title": "Climate Adaptation Strategies for Coastal Communities",
    "image": "https://i.ibb.co.com/MDHdCvp6/noah-buscher-x8-ZStuk-S2-PM-unsplash.jpg",
    "body": "Coastal communities face increasing risks from sea-level rise, cyclones, and storm surges. Adaptation strategies such as mangrove restoration, resilient housing, and early warning dissemination are critical. This blog examines practical adaptation measures that have proven effective.",
    "user": {
      "id": 1,
      "name": "John Doe",
      "avatar": "https://i.pravatar.cc/40?img=1"
    }
  },
  {
    "id": 8,
    "title": "Using Data and Technology in Humanitarian Response",
    "image": "https://i.ibb.co.com/MkPT5JFk/john-o-nolan-u-MWPrc-Rsrto-unsplash.jpg",
    "body": "Data-driven decision-making is transforming humanitarian response. From mobile data collection to real-time dashboards, technology enables faster, more accurate interventions. This article discusses how data analytics improves targeting, monitoring, and accountability in humanitarian programs.",
    "user": {
      "id": 2,
      "name": "Jane Smith",
      "avatar": "https://i.pravatar.cc/40?img=2"
    }
  },
  {
    "id": 9,
    "title": "Urban Flood Risk and the Role of Infrastructure Planning",
    "image": "https://i.ibb.co.com/dsvB0fP6/grant-ritchie-x1w-Q78x-NEY-unsplash.jpg",
    "body": "Rapid urbanization increases flood risk due to inadequate drainage and land-use planning. Sustainable infrastructure, green spaces, and integrated water management are essential to reduce urban flood impacts. This blog explores planning approaches that enhance urban resilience.",
    "user": {
      "id": 3,
      "name": "Alice Johnson",
      "avatar": "https://i.pravatar.cc/40?img=3"
    }
  },
  {
    "id": 10,
    "title": "The Future of Impact-Based Forecasting",
    "image": "https://i.ibb.co.com/wNvTmwJN/gustavo-quepons-p-F-2lrj-Wi-JE-unsplash.jpg",
    "body": "Impact-based forecasting shifts the focus from weather variables to potential impacts on people, assets, and livelihoods. By linking forecasts with anticipatory actions, governments and NGOs can act before disasters strike. This article explores the future potential of impact-based forecasting systems.",
    "user": {
      "id": 1,
      "name": "John Doe",
      "avatar": "https://i.pravatar.cc/40?img=1"
    }
  }
]
